app/Controllers/admin/KategoriVideoController.php

SELECT *
FROM `tb_kategori_video`
---
    public function create()
    {// Pengecekan apakah pengguna sudah login atau belum
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('login'));
            // Ubah 'login' sesuai dengan halaman login Anda
        }

        $role = session()->get('role');
        if ($role !== 'admin') {
            // Jika peran bukan admin, arahkan ke halaman lain (misal: user)
            return redirect()->to(base_url('/')); // Sesuaikan dengan URL halaman user
        }

        $model = new KategoriVideoModel();
        $data['kategori_videos'] = $model->findAll();