app/Controllers/admin/KategoriVideo.php

    public function proses_tambah()
    {
        $kategori_model = new KategoriVideoModels();
        $data = [
            'nama_kategori_video' => $this->request->getVar("nama_kategori_video"),
        ];

        if (!empty($data['nama_kategori_video'])) {
            $kategori_model->save($data);
---
INSERT INTO `tb_kategori_video` (`nama_kategori_video`) VALUES ('Video Uji Coba')