app/Controllers/admin/Video.php

SELECT *
FROM `tb_video`
---
    public function index()
    {
        if (!session()->get('logged_in')) {
            return redirect()->to(base_url('login'));
        }

        $role = session()->get('role');
        if ($role !== 'admin') {
            return redirect()->to(base_url('/'));
        }

        $video_model = new VideoPembelajaranModels();
        $videos = $video_model->findAll();