app/Controllers/user/Memberctrl.php

SELECT *
FROM `tb_dpd`
SELECT *
FROM `tb_dpc`
---
    public function index()
    {
        // Pengecekan apakah pengguna sudah login atau belum
        if (!session()->get('logged_in')) {
                return redirect()->to(base_url('login'));
                // Ubah 'login' sesuai dengan halaman login Anda
        }
        $today = date('Y-m-d');

        $data = [
            'member' => $this->MemberModels->getMemberUser(),
            'dpd' => $this->DPDModels->findAll(),
            'dpc' => $this->DPCModels->findAll()