app/Controllers/user/Pengumumanctrl.php

SELECT *
FROM `tb_pengumuman`
WHERE `akhir_pengumuman` >= '2024-07-30'
SELECT *
FROM `tb_dpd`
---
    public function index()
    {
                // Pengecekan apakah pengguna sudah login atau belum
        if (!session()->get('logged_in')) {
                return redirect()->to(base_url('login'));
                // Ubah 'login' sesuai dengan halaman login Anda
        }
        $tanggal_hari_ini = date('Y-m-d');

        // Ambil data pengumuman dengan tanggal mulai yang lebih besar atau sama dengan tanggal hari ini
        $pengumuman_terdekat = $this->PengumumanModels->where('akhir_pengumuman >=', $tanggal_hari_ini)->findAll();

        $data = [
            'pengumuman' => $pengumuman_terdekat,
            'dpd' => $this->DPDModels->findAll()