app/Models/DPCModels.php

    public function getDPCAdmin()
    {
         return $this->db->table('tb_dpc')
         ->join('tb_dpd','tb_dpd.id_dpd=tb_dpc.id_dpd')
         ->orderBy('id_dpc', 'desc')
         ->get()->getResultArray();
---
SELECT *
FROM `tb_dpc`
JOIN `tb_dpd` ON `tb_dpd`.`id_dpd`=`tb_dpc`.`id_dpd`
ORDER BY `id_dpc` DESC