app/Models/MemberModels.php

    public function getMemberAdmin()
    {
         return $this->db->table('tb_member')
         ->join('tb_dpc','tb_dpc.id_dpc=tb_member.id_dpc')
         ->where('role', 'user')
         ->orderBy('id_member', 'desc')
         ->get()->getResultArray();
---
SELECT *
FROM `tb_member`
JOIN `tb_dpc` ON `tb_dpc`.`id_dpc`=`tb_member`.`id_dpc`
WHERE `role` = 'user'
ORDER BY `id_member` DESC

    public function getMemberUser()
    {
         return $this->db->table('tb_member')
         ->join('tb_dpc','tb_dpc.id_dpc=tb_member.id_dpc')
         ->where('role', 'user')
         ->orderBy('RAND()')
         ->get()->getResultArray();
---
SELECT *
FROM `tb_member`
JOIN `tb_dpc` ON `tb_dpc`.`id_dpc`=`tb_member`.`id_dpc`
WHERE `role` = 'user'
ORDER BY RAND()